---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentsLength
source: html/dcacf5d1-99ea-be5c-0994-d4cc4ed83ce0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentsLength Property

"End Segments Length"

## Syntax (C#)
```csharp
public static ForgeTypeId GridEndSegmentsLength { get; }
```